IDEA Open Model
Polygon2D Class
 Represents a polygon in two-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Polygon2D
 IdeaRS.OpenModel.Geometry2D.TemperatureCurve2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class Polygon2D : OpenObject
Public Class Polygon2D
	Inherits OpenObject
public ref class Polygon2D : public OpenObject
The Polygon2D type exposes the following members.
Constructors
Name | Description
Polygon2D
 Constructor
Top
Properties
Name | Description
Points
 List of polygon points
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace